<template>
  <div>
    <section class="text-gray-600 body-font">
      <div class="container px-5 my-16 mx-auto flex flex-wrap">
        <h1 class="title-font sm:text-4xl text-3xl sm:w-full !w-2/3 mb-4 font-medium text-gray-900">
          {{ services.header }}
        </h1>
        <div class="flex flex-wrap -m-4 mt-8">
          <div v-for="(i, k) in services.list" :key="k" class="p-4 lg:w-1/2 md:w-full">
            <div class="flex border-2 rounded-lg border-gray-200 border-opacity-50 p-8 sm:flex-row flex-col">
              <div class="flex-grow">
                <h2 class="text-gray-900 text-lg title-font font-medium mb-3">
                  {{ i.name }}
                </h2>
                <p class="leading-relaxed text-lg">{{ i.description }}</p>
                <a class="mt-3 text-indigo-500 inline-flex items-center"
                  >Learn More
                  <svg fill="none" stroke="currentColor" stroke-linecap="round" stroke-linejoin="round" stroke-width="2" class="w-4 h-4 ml-2" viewBox="0 0 24 24">
                    <path d="M5 12h14M12 5l7 7-7 7"></path>
                  </svg>
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
    </section>
    <section>
      <h1 class="uk-heading-small my-12 pb-6 lg:w-full xl:w-2/3 !font-thin">{{ text.header }}</h1>
      <div class="uk-child-width-1-2@s uk-child-width-1-2@m uk-child-width-1-3@l uk-grid-match" uk-grid>
        <div v-for="(i, k) in text.list" :key="k">
          <div class="uk-card uk-card-default uk-card-hover uk-card-body uk-light uk-background-muted">
            <h3 class="uk-card-title text-slate-600">{{ i.id }}. {{ i.name }}</h3>
            <p class="text-slate-800">{{ i.description }}</p>
          </div>
        </div>
      </div>
    </section>
    <p>{{ text }}</p>
  </div>
</template>

<script>
export default {
  data() {
    return {
      services: {
        header: "Использование услуг IT аутсорса имеет множество преимуществ для бизнеса, среди которых:",
        list: [
          {
            name: "Снижение затрат. ",
            description: "Вместо того, чтобы нанимать своих собственных ИТ-специалистов, компании могут воспользоваться услугами IT аутсорса и сэкономить на затратах на обучение, оборудование и зарплаты сотрудников.",
          },
          {
            name: "Высокая квалификация специалистов. ",
            description: "IT аутсорс компании имеют широкий круг специалистов, имеющих большой опыт работы в различных областях ИТ, что гарантирует высокий уровень квалификации и профессионализма.",
          },
          {
            name: "Более высокий уровень безопасности. ",
            description: "IT аутсорс компании имеют опыт работы c различными системами безопасности и могут предоставить компаниям более высокий уровень защиты от кибератак и утечек данных.",
          },
          {
            name: "Гибкость и масштабируемость. ",
            description: "IT аутсорс компании могут быстро масштабировать свои услуги, чтобы соответствовать изменяющимся потребностям компании. Это позволяет гибко реагировать на изменения в рыночных условиях и экономии ресурсов.",
          },
          {
            name: "Концентрация на основной деятельности. ",
            description: "Использование IT аутсорса позволяет компаниям сосредоточиться на своей основной деятельности и наращивать конкурентные преимущества в своей отрасли, вместо того, чтобы тратить время и ресурсы на ИТ-разработку и обслуживание.",
          },
        ],
      },
      text: {
        header: "12 преимуществ для бизнеса при использовании услуг IT-аутсорсинга",
        list: [
          {
            id: 1,
            name: "Снижение затрат.",
            description: "IT-аутсорсинг позволяет снизить расходы на обслуживание IT-инфраструктуры, т.к. компания не будет вынуждена нанимать сотрудников и покупать необходимое оборудование.",
          },
          {
            id: 2,
            name: "Большой опыт.",
            description: "IT-аутсорсинговые компании имеют обширный опыт работы с различными проектами и системами, что позволяет им обеспечивать более высокое качество работы.",
          },
          {
            id: 3,
            name: "Концентрация на основной деятельности.",
            description: "Благодаря IT-аутсорсингу компания может сосредоточиться на своей основной деятельности, не тратя время и ресурсы на решение IT-проблем.",
          },
          {
            id: 4,
            name: "Более быстрая реакция на проблемы.",
            description: "IT-аутсорсинговые компании имеют профессиональный и опытный персонал, который быстро может решить возникающие проблемы.",
          },
          {
            id: 5,
            name: "Большая гибкость.",
            description: "IT-аутсорсинг позволяет компании легко масштабировать свои IT-ресурсы в соответствии с растущими потребностями бизнеса.",
          },
          {
            id: 6,
            name: "Увеличение производительности.",
            description: "IT-аутсорсинговые компании имеют доступ к новейшим технологиям и методикам, что позволяет повысить производительность бизнеса.",
          },
          {
            id: 7,
            name: "Большая защита данных.",
            description: "IT-аутсорсинговые компании имеют современные системы защиты данных, которые обеспечивают высокий уровень безопасности компании.",
          },
          {
            id: 8,
            name: "Повышение надежности.",
            description: "IT-аутсорсинговые компании обеспечивают более высокую надежность работы IT-инфраструктуры.",
          },
          {
            id: 9,
            name: "Увеличение конкурентоспособности.",
            description: "Благодаря использованию новейших технологий и методик IT-аутсорсинг позволяет компании увеличить свою конкурентоспособность на рынке.",
          },
          {
            id: 10,
            name: "Поддержка 24/7.",
            description: "IT-аутсорсинговые компании обеспечивают круглосуточную техническую поддержку, что позволяет быстро решать возникающие проблемы и минимизировать время простоя системы.",
          },
          {
            id: 11,
            name: "Снижение затрат на обучение и поддержку.",
            description: "Аутсорсинг IT-услуг - это экономичный и удобный способ снизить затраты на найм и обучение IT-специалистов, а также переложить ответственность на провайдера.",
          },
          {
            id: 12,
            name: "Расширенный доступ к новейшим технологиям.",
            description: "Аутсорсинг IT-услуг дает доступ к новейшим технологиям и инструментам, которые не доступны внутренней IT-команде. Их использование может улучшить процессы и эффективность бизнеса.",
          },
        ],
      },
    };
  },
};
</script>
